25-cookies-and-sessions/rails-quest/app/controllers/responses_controller.rb

SELECT  "questions".* FROM "questions" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]
---
    def new
        @message = flash[:message]
        @number_correct = session[:number_correct]
        @question = Question.all.sample

INSERT INTO "responses" ("question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 51], ["answer_id", 201], ["created_at", "2019-06-11 15:30:35.607146"], ["updated_at", "2019-06-11 15:30:35.607146"]]
---
    def create
        if session[:number_correct]
            @number_correct = session[:number_correct]
        else
            @number_correct = 0 # Must be the first time they've answered a question
        end
        response = Response.create(response_params)